In [192]:
import pandas as pd
import os

In [193]:
# Import the data. Create a DataFrame
student_data = os.path.join(r"C:\Users\15152\Desktop\DataClass\Assignments\School_District_Analysis\new_full_student_data.csv")
student_df = pd.read_csv(student_data)

In [194]:
# Confirm that Pandas correctly imported the data
student_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9th,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9th,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9th,Wagner High School,89.0,70.4,Public,846745
3,62582498,Susan Richardson,9th,Silva High School,69.7,80.3,Public,991918
4,16437227,Sherry Davis,11th,Bowers High School,NaN,27.5,Public,848324

In [195]:
#Display the grade column by using loc
student_df.loc[:,"grade"] = student_df.loc[:,"grade"].str.replace("th","")
student_df.loc[:,"grade"]

0         9
1         9
2         9
3         9
4        11
         ..
19509    12
19510     9
19511    11
19512    11
19513    12
Name: grade, Length: 19514, dtype: object

In [196]:
# Display the first three rows of Columns 3, 4, and 5 by using iloc.
student_df.iloc[0:3, 3:6]

            school_name  reading_score  math_score
0  Sullivan High School           59.0        88.2
1     Dixon High School           94.7        73.5
2    Wagner High School           89.0        70.4

In [197]:
# Select the rows for Grade 9, and display their summary statistics by using loc and describe.
# student_df.loc[student_df[:,["grade"]=="9.0"]].describe()

In [198]:
# minimum overall reading score.
min_reading_score = student_df['reading_score'].min()
min_reading_score

10.5

In [205]:
# Store the row with the minimum overall reading score in min_reading_row by using loc and the min_reading_score variable.
#student_df.loc(student_df[:,["reading_score" == min_reading_score]])
#student_df["reading_score"]

In [203]:
# Select all the reading scores from the 10th graders at Dixon High School by using loc with conditionals.
student_df.loc[(student_df["school_name"] == "Dixon High School") & (student_df["grade"]== "10th")]
student_df["reading_score"]

0        59.0
1        94.7
2        89.0
3        69.7
4         NaN
         ...
19509    43.3
19510    52.1
19511    93.9
19512    94.6
19513    82.3
Name: reading_score, Length: 19514, dtype: float64

In [202]:
# Find the mean reading score for all the students in Grades 11 and 12 combined by using conditional statements and loc or iloc.
student_df.loc[(student_df["grade"] == "11th") & (student_df["grade"] == "12th")]
student_df["reading_score"].mean()

72.40785364185581